holmanej/ASM_PIC18/ASM_PIC18.X/p18f14k22_mod.inc
;----- CONFIG1H Options --------------------------------------------------
_FOSC_LP_1H          EQU  H'F0'; LP oscillator
_FOSC_XT_1H          EQU  H'F1'; XT oscillator
_FOSC_HS_1H          EQU  H'F2'; HS oscillator
_FOSC_ERCCLKOUT_1H   EQU  H'F3'; External RC oscillator, CLKOUT function on OSC2
_FOSC_ECCLKOUTH_1H   EQU  H'F4'; EC, CLKOUT function on OSC2 (high)
_FOSC_ECH_1H         EQU  H'F5'; EC (high)
_FOSC_ERC_1H         EQU  H'F7'; External RC oscillator
_FOSC_IRC_1H         EQU  H'F8'; Internal RC oscillator
_FOSC_IRCCLKOUT_1H   EQU  H'F9'; Internal RC oscillator, CLKOUT function on OSC2
_FOSC_ECCLKOUTM_1H   EQU  H'FA'; EC, CLKOUT function on OSC2 (medium)
_FOSC_ECM_1H         EQU  H'FB'; EC (medium)
_FOSC_ECCLKOUTL_1H   EQU  H'FC'; EC, CLKOUT function on OSC2 (low)
_FOSC_ECL_1H         EQU  H'FD'; EC (low)

_PLLEN_OFF_1H        EQU  H'EF'; PLL is under software control
_PLLEN_ON_1H         EQU  H'FF'; Oscillator multiplied by 4

_PCLKEN_OFF_1H       EQU  H'DF'; Primary clock is under software control
_PCLKEN_ON_1H        EQU  H'FF'; Primary clock enabled

_FCMEN_OFF_1H        EQU  H'BF'; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'; Oscillator Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'; Oscillator Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRTEN_ON_2L        EQU  H'FE'; PWRT enabled
_PWRTEN_OFF_2L       EQU  H'FF'; PWRT disabled

_BOREN_OFF_2L        EQU  H'F9'; Brown-out Reset disabled in hardware and software
_BOREN_ON_2L         EQU  H'FB'; Brown-out Reset enabled and controlled by software (SBOREN is enabled)
_BOREN_NOSLP_2L      EQU  H'FD'; Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)
_BOREN_SBORDIS_2L    EQU  H'FF'; Brown-out Reset enabled in hardware only (SBOREN is disabled)

_BORV_30_2L          EQU  H'E7'; VBOR set to 3.0 V nominal
_BORV_27_2L          EQU  H'EF'; VBOR set to 2.7 V nominal
_BORV_22_2L          EQU  H'F7'; VBOR set to 2.2 V nominal
_BORV_19_2L          EQU  H'FF'; VBOR set to 1.9 V nominal

;----- CONFIG2H Options --------------------------------------------------
_WDTEN_OFF_2H        EQU  H'FE'; WDT is controlled by SWDTEN bit of the WDTCON register
_WDTEN_ON_2H         EQU  H'FF'; WDT is always enabled. SWDTEN bit has no effect.

_WDTPS_1_2H          EQU  H'E1'; 1:1
_WDTPS_2_2H          EQU  H'E3'; 1:2
_WDTPS_4_2H          EQU  H'E5'; 1:4
_WDTPS_8_2H          EQU  H'E7'; 1:8
_WDTPS_16_2H         EQU  H'E9'; 1:16
_WDTPS_32_2H         EQU  H'EB'; 1:32
_WDTPS_64_2H         EQU  H'ED'; 1:64
_WDTPS_128_2H        EQU  H'EF'; 1:128
_WDTPS_256_2H        EQU  H'F1'; 1:256
_WDTPS_512_2H        EQU  H'F3'; 1:512
_WDTPS_1024_2H       EQU  H'F5'; 1:1024
_WDTPS_2048_2H       EQU  H'F7'; 1:2048
_WDTPS_4096_2H       EQU  H'F9'; 1:4096
_WDTPS_8192_2H       EQU  H'FB'; 1:8192
_WDTPS_16384_2H      EQU  H'FD'; 1:16384
_WDTPS_32768_2H      EQU  H'FF'; 1:32768

;----- CONFIG3H Options --------------------------------------------------
_HFOFST_OFF_3H       EQU  H'F7'; The system clock is held off until the HFINTOSC is stable.
_HFOFST_ON_3H        EQU  H'FF'; HFINTOSC starts clocking the CPU without waiting for the oscillator to stablize.

_MCLRE_OFF_3H        EQU  H'7F'; RA3 input pin enabled; MCLR disabled
_MCLRE_ON_3H         EQU  H'FF'; MCLR pin enabled, RA3 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'; Stack full/underflow will not cause Reset
_STVREN_ON_4L        EQU  H'FF'; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'; Single-Supply ICSP enabled

_BBSIZ_OFF_4L        EQU  H'F7'; 1kW boot block size
_BBSIZ_ON_4L         EQU  H'FF'; 2kW boot block size

_XINST_OFF_4L        EQU  H'BF'; Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
_XINST_ON_4L         EQU  H'FF'; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'; Background debugger enabled, RA0 and RA1 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'; Background debugger disabled, RA0 and RA1 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'; Block 0 code-protected
_CP0_OFF_5L          EQU  H'FF'; Block 0 not code-protected

_CP1_ON_5L           EQU  H'FD'; Block 1 code-protected
_CP1_OFF_5L          EQU  H'FF'; Block 1 not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'; Boot block code-protected
_CPB_OFF_5H          EQU  H'FF'; Boot block not code-protected

_CPD_ON_5H           EQU  H'7F'; Data EEPROM code-protected
_CPD_OFF_5H          EQU  H'FF'; Data EEPROM not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'; Block 0 write-protected
_WRT0_OFF_6L         EQU  H'FF'; Block 0 not write-protected

_WRT1_ON_6L          EQU  H'FD'; Block 1 write-protected
_WRT1_OFF_6L         EQU  H'FF'; Block 1 not write-protected

;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'; Configuration registers write-protected
_WRTC_OFF_6H         EQU  H'FF'; Configuration registers not write-protected

_WRTB_ON_6H          EQU  H'BF'; Boot block write-protected
_WRTB_OFF_6H         EQU  H'FF'; Boot block not write-protected

_WRTD_ON_6H          EQU  H'7F'; Data EEPROM write-protected
_WRTD_OFF_6H         EQU  H'FF'; Data EEPROM not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'; Block 0 protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'; Block 0 not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'; Block 1 protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'; Block 1 not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'; Boot block protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'; Boot block not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST
